[
    {
        "roomNo": "0",
        "sender": "Montana Jones(Participant)",
        "message": "From the great land of red blooded Montanna, you grew up as the son of a museum curator. Those long nights alone in the museum’s Egyptian section only increased your fascination towards the ancient civilization. After having your first major breakthrough in the valley, you’ve been given the chance of a lifetime to make an independent excavation in the ever mysterious tomb of king Tuttenkhamun. With your trusted sidekick Ali by your side, you enter the tomb."
    },
    {
        "roomNo": "0",
        "sender": "Abdul Ali(NPC)",
        "message": "Your loyal sidekick. Born and brought up in Egypt, Ali has always been fascinated with the history of his land. From the age of 18, Ali has been a worker for several excavation teams in and around the Valley of Kings(the ancient burial site of Pharaohs). In your first ever independent excavation, Ali helped guide you around the traditions and culture practiced by the people of the land. After discovering a tomb room, Ali was caught under a collapsing roof structure. You led a team into the collapsing structure and pulled Ali out from the depths. Ever since, Ali has been helping you as a lead excavator in all your projects."
    },
    {
        "roomNo": "1",
        "sender": "MJ",
        "message": "Careful Ali, this tomb has been sitting pretty for quite a while now. Ah there's the final resting place of the boy king. You can almost feel the history in these walls can’t you?"
    },
    {
        "roomNo": "1",
        "sender": "Ali",
        "message": "If only his-story was pretty too"
    },
    {
        "roomNo": "1",
        "sender": "MJ",
        "message": "..."
    },
    {
        "roomNo": "1",
        "sender": "Ali",
        "message": "hehehe"
    },
    {
        "roomNo": "1",
        "sender": "MJ",
        "message": "moving on, the premise of this excavation is this particular corner of the tomb room. Archeologists have always found this room to be extremely small for a ruling Pharaoh’s tomb. During my research, I went through several photographs of the room as taken originally by Howard Carter when he first found Tut and compared them with the modern day pictures. Although most of the room has remained similar, this particular wall is quite interesting. Notice how the ornaments in the bottom half have gradually shifted away from the centre of the tomb and have left a dust trail? "
    },
    {
        "roomNo": "1",
        "sender": "Ali",
        "message": "Oh yeah! Could that be due to a slow yet continuous wind?"
    },
    {
        "roomNo": "1",
        "sender": "MJ",
        "message": "Precisely what I thought. And if you go close enough here….and just put your hand near the base...OH! I FEEL THE WIND!"
    },
    {
        "roomNo": "1",
        "sender": "Ali",
        "message": "That sounds...cool? Wind isn’t all that uncommon here, so what’s the idea?"
    },
    {
        "roomNo": "1",
        "sender": "MJ",
        "message": "Don’t you get it? The wind is blowing these objects away from the centre of the room! Which shows that there's another area behind this wall which is pulling air from here!"
    },
    {
        "roomNo": "1",
        "sender": "Ali",
        "message": "You know you could be onto something. The hieroglyphics here do support your idea as they showcase the path to the field of reeds, or heaven. In ancient Egypt, it was believed that these hieroglyphics were needed to guide the Pharaohs to take their rightful place among the dead. It would make sense to have a path out of here. The path usually consists of several chambers and possibly treasures too! We need to get to them! But that would mean solving these puzzles. It was said only those who deserved to go to the field of reeds could solve them."
    },
    {
        "roomNo": "1",
        "sender": "MJ",
        "message": "Let’s try our luck shall we…"
    },
    {
        "roomNo": "2",
        "sender": "narrator",
        "message": "(Having solved the last puzzle, a rumbling sound engulfs the room as the wall in front of the duo slowly lifts to reveal a huge hall. However, there's a loud crack and the wall falls down rapidly, breaking the foundation below them, as our duo fall down)"
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "(slowly getting up) jones? … Jones, are you fine?? JONES??"
    },
    {
        "roomNo": "2",
        "sender": "MJ",
        "message": "Ouch that hurt a lot. I'm here, don't bring the roof down on us with your screaming."
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "Or more to the point the floor down on us hehe."
    },
    {
        "roomNo": "2",
        "sender": "MJ",
        "message": "…"
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "I’m so funny"
    },
    {
        "roomNo": "2",
        "sender": "MJ",
        "message": "Sometimes I wish your puns had a mute option. Anyway, where are we?"
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "It looks like the weight of lifting the stone wall was too much for the old ropes. The impact of the wall falling down broke the floor beneath us. Looking around, this looks like a room built below the tomb. The roof is too far away for us to climb up. (Uses walkie talkie) Hello? Can anyone hear us? (only static)"
    },
    {
        "roomNo": "2",
        "sender": "MJ",
        "message": "(Looking away)These hieroglyphics…, they look a lot like the ones found in the tombs of the traitors of pharaohs. (Looks to the side) AHHH!"
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "What happened? Are you alright?"
    },
    {
        "roomNo": "2",
        "sender": "MJ",
        "message": "Yea this statue of Anubis scared me.  The feet of the statue are pointing towards something. Let's go check it out...and what have we here? Oh! There's another sarcophagus!!"
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "These markings, they indicate a great sin. Could this be...no …"
    },
    {
        "roomNo": "2",
        "sender": "MJ",
        "message": "What is it? Spit it out!"
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "These markings show a member of the royal family who did something terrible. So terrible that Egypt decided to never use his name again..."
    },
    {
        "roomNo": "2",
        "sender": "narrator",
        "message": "(vessel cracks in the distance)"
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "What was that!? Can we get out of here?? The radio is still silent and I doubt we will get anyone to help us out."
    },
    {
        "roomNo": "2",
        "sender": "MJ",
        "message": "The only way out is to go through the path to the field of reeds which should eventually lead us out. Hmm this door looks like a great place to start, let's check out the Hieroglyphics here."
    },
    {
        "roomNo": "2",
        "sender": "Ali",
        "message": "And I’ll just wait here...behind you...just in case any unholy being comes out of anywhere. You make a great human shield, you know?"
    },
    {
        "roomNo": "2",
        "sender": "MJ",
        "message": "*Sigh*"
    },
    {
        "roomNo": "3",
        "sender": "narrator",
        "message": "(The door creaks loudly as a path is seen)"
    },
    {
        "roomNo": "3",
        "sender": "MJ",
        "message": "This pathway looks extremely...dark. I wonder what these markings mean. I do not understand them. Ali, could you help me out?"
    },
    {
        "roomNo": "3",
        "sender": "Ali",
        "message": "The reason you don’t understand them is because they’re a different dialect. This isn’t the language of the pharaohs, it's the language of the slaves. And moreover, these markings aren’t as old as the original tomb. I’d say there was a good 50 year gap between the two."
    },
    {
        "roomNo": "3",
        "sender": "MJ",
        "message": "The slaves? What were they doing down here?"
    },
    {
        "roomNo": "3",
        "sender": "Ali",
        "message": "(looking at the markings) This tells us their story. It shows the constant abuse they were made to face, until it exceeded their breaking point. A great leader collectivized the group and told them about a promised land far away from the slavery of Egypt."
    },
    {
        "roomNo": "3",
        "sender": "MJ",
        "message": "This sounds extremely familiar, where have I heard this before?"
    },
    {
        "roomNo": "3",
        "sender": "Ali",
        "message": "This reminds me of the story of Moses from the bible. But how is that related to Tut? None of this makes any sense."
    },
    {
        "roomNo": "3",
        "sender": "MJ",
        "message": "Well it doesn't matter, we need to make our way out of here and through the path to the field of reeds if we want to get out of here."
    },
    {
        "roomNo": "3",
        "sender": "narrator",
        "message": "(Swooshing sound)"
    },
    {
        "roomNo": 3,
        "sender": "Voice",
        "message": "“To find your way out, you must first look to the past, understanding the past helps us understand our future”"
    },
    {
        "roomNo": "3",
        "sender": "MJ",
        "message": " Did you hear that too?"
    },
    {
        "roomNo": "3",
        "sender": "Ali",
        "message": "Thank god. I thought I was losing my mind. But who was that? Is there someone else here with us? HELLO? HELP US WE ARE STUCK DOWN HERE!"
    },
    {
        "roomNo": "3",
        "sender": "MJ",
        "message": "(Looking around)I can’t see anyone here. But what did that mean? “Look to the past”...? Irrespective, I think we need to understand these markings through the path."
    },
    {
        "roomNo": "3",
        "sender": "narrator",
        "message": "(As they walk forward, a small room approaches.)"
    },
    {
        "roomNo": "3",
        "sender": "Ali",
        "message": "This room is really out of place… Why would there be such a small room with no relevance? There’s just a bunch of tools and a couple of bags...? Moreover, the room looks crudely constructed...almost as if it was a hideout for AHH!!"
    },
    {
        "roomNo": "3",
        "sender": "MJ",
        "message": "What happened??"
    },
    {
        "roomNo": "3",
        "sender": "Ali",
        "message": "There’s a skeleton here. The attire seems to show it's that of a slave of the past. Probably one of the workers who made this area. But why is it here…?"
    },
    {
        "roomNo": "3",
        "sender": "narrator",
        "message": "(Loud noises as the walls of the room close in)"
    },
    {
        "roomNo": "3",
        "sender": "MJ",
        "message": "That’s our signal to get out of here...the door looks locked, we need to understand these markings if we are to find the key out of here."
    },
    {
        "roomNo": "3",
        "sender": "Ali",
        "message": "Hurry! I don't want to be another skeleton for people a hundred years from now to find!!"
    },
    {
        "roomNo": "4",
        "sender": "narrator",
        "message": "(As the final puzzle is solved, they find the key buried within one of the bags. They struggle to unlock the door in time and barely make it out before the walls completely close in.)"
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "Phew that was close huh? Ali..?"
    },
    {
        "roomNo": "4",
        "sender": "Ali",
        "message": "That brings a whole new meaning to unlocking mysteries."
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "How you continue to make such terrible puns at a time like this baffles me."
    },
    {
        "roomNo": "4",
        "sender": "Ali",
        "message": "It is a gift which simply can't be turned off. There is no switch for this (Points to self)"
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "Your antics aside, looks like the pathway continues here. And look! The markings are back too."
    },
    {
        "roomNo": "4",
        "sender": "Ali",
        "message": "The story continues… “The great leader was a brilliant orator and spoke to the masses to escape one day. The slaves all organized a common time and day to break away from the guards. Several died but they made their way out of the capital. They faced several armies along the way but the leader always managed to get them out. The masses soon began to believe that the leader possessed supernatural powers. After nearly a month on the run, they approached their refuge.”"
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "Hmm so this is definitely the story of Moses from the Bible...but it seems off..."
    },
    {
        "roomNo": "4",
        "sender": "Ali",
        "message": "I thought so too. I wonder if-"
    },
    {
        "roomNo": "4",
        "sender": "narrator",
        "message": "(Loud whooshing sound and a silhouette appears)"
    },
    {
        "roomNo": "4",
        "sender": "Voice",
        "message": "“Don’t let me stay here on this planet. I need to be set free”"
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "Who are you?? What do you want???"
    },
    {
        "roomNo": "4",
        "sender": "Voice",
        "message": "“I’m the royal whose sarcophagus you opened. I have not sinned, but was condemned to walk the earth and never reach the field of reeds. My ability to help you is limited by my memory. I’ve spent so many years locked in my room I barely remember anything. The only thing I do know is the pathway to the field of reeds, inscribed into my mind by the priests who mummified me, condemned to remember and long for the one thing I can never get.”"
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "Why did you never try to solve these puzzles and get out yourself?"
    },
    {
        "roomNo": "4",
        "sender": "Voice",
        "message": "“This is not a language I can understand. I need your help to get me to the path from where both of us can leave; me from this planet and you from this tomb.”"
    },
    {
        "roomNo": "4",
        "sender": "Ali",
        "message": "(whispering) I've got a bad feeling about this. Let’s just move on. There's nothing good that can happen for us from helping this...thing."
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "This “thing” is probably the only way we can get out of the path once we get to it. And besides, it can't do anything to us. It's an amnesiatic ghost, probably the worst villain in a story on mummies and ancient Egypt ever. Let’s just get out of here as quickly as possible before we face a thousand other issues."
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "(to the voice) Ok then. Once we get you on the path, you need to help us out. Until then, stay silent and behind us."
    },
    {
        "roomNo": "4",
        "sender": "Ali",
        "message": "That looks like a ladder to the top level! Damn it, it's been shut by a door at the top. You know the drill, get to solving the puzzles MJ!"
    },
    {
        "roomNo": "4",
        "sender": "MJ",
        "message": "Yea but this time, you get to hangout with a ghost haha."
    },
    {
        "roomNo": "5",
        "sender": "MJ",
        "message": "Ah, finally the upper level. Doesn’t look like there's a direct path back to Tut’s room. I guess we move on forward."
    },
    {
        "roomNo": "5",
        "sender": "Ali",
        "message": "These markings are still consistent with the markings below. The story continues, “Among the group of escapee slaves, there were two members who had been here during the burial of king Tut. However, something had happened here which changed their mind about the circumstances of his death. They suspected that it was their leader who had killed the boy king. They believed that going against the gods of Egypt by helping the leader would lead to their eternal damnation and as a result, killed the leader before he ever made it out of Egypt.”"
    },
    {
        "roomNo": "5",
        "sender": "MJ",
        "message": "So Moses never made it out of Egypt? But why is any of this written here? Who came back?"
    },
    {
        "roomNo": "5",
        "sender": "Voice",
        "message": "“All of this sounds vaguely...familiar but feels like a lifetime ago.”"
    },
    {
        "roomNo": "5",
        "sender": "Ali",
        "message": "The markings continue, “Having made it to the promised land, the slaves realized their leader hadn’t made it with them. They soon found the duo responsible for the death of their leader and cast them out of their land. They upheld the legacy of their leader and called him Moses, taking away from his Egyptian name Thutmose. The duo returned back to Egypt and soon realized their mistake in killing Moses. They decided to take the remains back to the Pharaohs in the hope of finding a burial for him.”"
    },
    {
        "roomNo": "5",
        "sender": "MJ",
        "message": "Wow. So Moses was Thutmose? Thutmose the uncle of king Tut??"
    },
    {
        "roomNo": "5",
        "sender": "Ali",
        "message": "That would be consistent with the timing of the events in the Bible. Moreover, Moses was always known to have been raised by the pharaohs as one of their own, even though he was born a slave and adopted by the royals. He was known to have got into problems with the rulers due to his tendencies to help the slaves around him. It was probably why he killed king Tut in an attempt to raise the rebellion."
    },
    {
        "roomNo": "5",
        "sender": "Voice",
        "message": "“I remember, I remember. My remains were brought here and the Pharaoh condemned me. Condemned me to stay buried below the one I killed, forever hidden beneath.”"
    },
    {
        "roomNo": "5",
        "sender": "MJ",
        "message": "At least we now know who you are. It is incredible that we are interacting with “The Moses '' of the bible. Now do you see Ali? Helping this spectre reach the field of reeds is our task. It's what our destiny is!"
    },
    {
        "roomNo": "5",
        "sender": "Ali",
        "message": "(whispers)I still have my reservations on all of this."
    },
    {
        "roomNo": "5",
        "sender": "MJ",
        "message": "Nevermind the cynical Ali, let us move on now, the path should be just beyond this door."
    },
    {
        "roomNo": "6",
        "sender": "Ali",
        "message": "Wow so this is the path! These hieroglyphs are so detailed!"
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "This describes the way to activate the path. It seems we need to cross this bridge across the chasm and we’ll find a long hall where Osiris will appear to judge our actions having given a form of sacrifice, or atleast Moses’ actions. We should ideally find an exit path there. Bu-"
    },
    {
        "roomNo": "6",
        "sender": "Ali",
        "message": "AAAAAA"
    },
    {
        "roomNo": "6",
        "sender": "narrator",
        "message": "(Ali trips on an ornament and falls into the chasm. He hangs on to the dangling rope of the bridge)"
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "ALI!! Hold on, I'm coming to help you."
    },
    {
        "roomNo": "6",
        "sender": "Voice",
        "message": "“Wait Jones. The scriptures clearly indicate the need for a sacrifice. Even if you try your best you can’t pull him up, he's a lot heavier than you are and I can’t help either. Maybe it's  for the best if you just let go.”"
    },
    {
        "roomNo": "6",
        "sender": "Ali",
        "message": "What?? Are you crazy? Listen, Jones , I've always been there for you. Just pull me up and we can discuss this then."
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "There’s no way I’m letting you go. Ali, hold on!"
    },
    {
        "roomNo": "6",
        "sender": "narrator",
        "message": "(Suddenly the spectre startles MJ blocking his view and Ali struggles to hold on much longer)"
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "(to voice) What are you doing? Move!"
    },
    {
        "roomNo": "6",
        "sender": "Ali",
        "message": "I can’t hold the rope much longer- "
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "MOVE!! I NEED TO HELP HIM"
    },
    {
        "roomNo": "6",
        "sender": "Ali",
        "message": "HELP ME PLEASE AHH-* falls and dies * //don't say dies in the story but show it in a diff way"
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "(MJ is shocked and closes his eyes. He cries on the floor for a minute)"
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "Why didnt you move?! We couldve saved him. I couldve pulled him up!!"
    },
    {
        "roomNo": "6",
        "sender": "Voice",
        "message": "“I didnt mean to come in the way. BUt look around you. The rope was slipping and I can’t help. There was nothing you could do”"
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "BUt, But-"
    },
    {
        "roomNo": "6",
        "sender": "Voice",
        "message": "“There was nothing you could do about it. He is now in the field of reeds. You owe it to him to move on, complete this journey and make it out of here alive.”"
    },
    {
        "roomNo": "6",
        "sender": "narrator",
        "message": "(MJ wipes his tears away and stands up)"
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "You’re right. Let’s move forward from here. For Ali."
    },
    {
        "roomNo": "6",
        "sender": "narrator",
        "message": "(They cross the bridge)"
    },
    {
        "roomNo": "6",
        "sender": "Voice",
        "message": "“This...is just a room. No no no this is wrong. This is all wrong. Where is the grand hall?”"
    },
    {
        "roomNo": "6",
        "sender": "MJ",
        "message": "(exhausted) - Oh Ali. How I miss you."
    },
    {
        "roomNo": "6",
        "sender": "narrator",
        "message": "(As MJ sits down to rest his back pushes against a wall. A penny drops from his pocket and strikes the wall. A hollow sound emerges from the other end)"
    },
    {
        "roomNo": "6",
        "sender": "Voice",
        "message": "“Do you hear that?? This wall isn’t man made, it's a result of years of sand creeping through a crack. There should be a grand hall on the other end of it! Get to work digging!!” "
    },
    {
        "roomNo": "6",
        "sender": "narrator",
        "message": "(MJ reluctantly picks himself up and starts digging through the sandy wall)"
    },
    {
        "roomNo": "7",
        "sender": "narrator",
        "message": "(A crack of light is seen as a whole is made. MJ digs hurriedly and exposes a grand hall)"
    },
    {
        "roomNo": "7",
        "sender": "MJ",
        "message": "So this is the hall that we struggled to get to. That we lost Ali for…"
    },
    {
        "roomNo": "7",
        "sender": "Voice",
        "message": "“Come now, we mustn’t waste time. Osiris is waiting for us at the end of the hall.”"
    },
    {
        "roomNo": "7",
        "sender": "MJ",
        "message": "There are more markings here. These showcase King Tut’s life and his influence on the region. His father king Akhenaten was a crazed emperor who destroyed all the temples of Amun in an attempt to convert Egypt to worship only one god, Aten.Talk about a crazy emperor."
    },
    {
        "roomNo": "7",
        "sender": "Voice",
        "message": "“We must not judge a person’s actions especially when we know so little.”"
    },
    {
        "roomNo": "7",
        "sender": "MJ",
        "message": "What does that mean?"
    },
    {
        "roomNo": "7",
        "sender": "Voice",
        "message": "...."
    },
    {
        "roomNo": "7",
        "sender": "MJ",
        "message": "Anyway,  Nobody knows what happened to Akhenaten after his death. Although an initial burial site was found, his sarcophagus was missing. It’s likely that after shifting back to Thebes, a pharaoh ordered a shift in the remains of Akhenaten."
    },
    {
        "roomNo": "7",
        "sender": "narrator",
        "message": "(they approach the end of the hall)"
    },
    {
        "roomNo": "7",
        "sender": "MJ",
        "message": " Look! There's a small cave-like structure at the very end. That’s possibly the judging room of Anubis. We just need to find the right way in. Maybe these hieroglyphics could elaborate."
    },
    {
        "roomNo": "8",
        "sender": "Voice",
        "message": "“Ah finally at long last. How I’ve waited for this moment. Anubis? ANUBIS? WHERE IS ANUBIS??”"
    },
    {
        "roomNo": "8",
        "sender": "MJ",
        "message": "I don’t see anyone around. Are you sure this is the right room or-"
    },
    {
        "roomNo": "8",
        "sender": "Voice",
        "message": "“Of Course it is you brat. Look around you, everything is right!”"
    },
    {
        "roomNo": "8",
        "sender": "MJ",
        "message": "Hey! I really don’t appreciate that tone. (mumbles) Stupid annoying ghost, should just go back to being dead"
    },
    {
        "roomNo": "8",
        "sender": "narrator",
        "message": "(MJ spots markings on the far side of the room)"
    },
    {
        "roomNo": "8",
        "sender": "MJ",
        "message": "Hold on! The markings here indicate a special summoning ritual. What we need to do is explained in excruciating detail. This should be easy enough."
    },
    {
        "roomNo": "8",
        "sender": "Voice",
        "message": "“Bah! Finish it fast. I’ve waited for this moment for far too long. I want to, I need to go to the field of reeds."
    },
    {
        "roomNo": "8",
        "sender": "MJ",
        "message": " We need to etch a circle into the floor. Then, we recite the following verse engraved on these walls. But first, we’d need to decrypt the markings..."
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": "I have solved it! The verse reads\nYa 'Anubis, yda 'uwzuris. Astamae 'iilaa suti.\nYa 'Anubis, 'ant min yazan alqulbu. Astamae 'iilaa suti.\nYa 'Anubis, dalil almawtaa.\nAleawalim bayn alealamin maftuhatan,\nwa'amrak 'an tuqadim(ah) nafsak(h) fi eini."
    },
    {
        "roomNo": "100",
        "sender": "narrator",
        "message": "(Anubis appears. He is grand and carries the scales of justice in his hands.)"
    },
    {
        "room": "100",
        "sender": "Anubis",
        "message": "(glaring at the spectre)\n“Why do you summon me so late after your death? This room only allows one soul per tomb to pass through without going through the process of being weighed against the scales of justice.”"
    },
    {
        "roomNo": "100",
        "sender": "narrator",
        "message": "(Anubis opens a path which could lead a soul directly to the field of reeds)"
    },
    {
        "roomNo": "100",
        "sender": "Voice",
        "message": "“I was a great Pharaoh oh noble one. Please let me pass through”"
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": "WHAT? You weren't a pharaoh, just a member of the royal family! You never even presided over Egypt!"
    },
    {
        "roomNo": "100",
        "sender": "Voice",
        "message": "“Silence you mere human. Of Course I ruled the great land of Egypt. I am Akhenaten, Pharaoh and emperor of the land of Aten. A tragedy occurred when a priest of Amun cursed me into not leaving my sarcophagus to go to the field of reeds, but when they moved my tomb, it gave me a way out. I was so happy but then I found out that the tomb was hidden below. What's worse, they placed my annoying child’s tomb above my own. Me, a Pharaoh, and a great one placed below him, a 9 year old who could barely walk around like a king before dying. Weakling. Bah!”"
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": "(in disbelief) but but the markings said it was Thutmose-"
    },
    {
        "roomNo": "100",
        "sender": "Voice",
        "message": "“Thutmose was a disgusting adopted brother who cared more about the slaves than the Pharaohs or the Empire. I have never had any affiliation with him. The slaves who returned his body were chased out of the palace and hid out near my tomb. Don’t you get it? Don’t you see? It was I who had convinced those slaves that Thutmose killed Tuttenkhamun. Foolish one, Thutmose spoke the language of the slaves. Had it been him in here he would’ve made it out a long while ago!”"
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": "Oh God, Ali was right. Oh no, Oh no no no. What have I done?"
    },
    {
        "roomNo": "100",
        "sender": "Akhenaten/voice",
        "message": "“SIlence. I need to talk to anubis now and get my rightful place in the field of reeds. I did not deserve this eternal damnation but It will all now be worth it.”"
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": "I can make this right. I can still ensure justice prevails. I will not allow Akhenaten to enjoy the pleasures of the field of reeds. I owe it to Ali."
    },
    {
        "roomNo": "100",
        "sender": "Akhenaten/voice",
        "message": "“You fool! Don’t you see? There’s nothing you can do now. I’ll attain the peace I want and you can go back to your dreary life. With your pesky friend gone you should be thanking me. All he did was hold you down ha!”"
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": " NO. Don’t you dare! I know what to do. I know how I can stop you.(MJ gets a sharp rock out and stabs himself and dies. His essence enters into osiris’ path)"
    },
    {
        "roomNo": "100",
        "sender": "narrator",
        "message": "(MJ gets a sharp rock out and stabs himself and dies. His essence enters into osiris’ path)"
    },
    {
        "roomNo": "100",
        "sender": "Akhenaten/voice",
        "message": "“Nooo. What have you done?! I will have my revenge!!"
    },
    {
        "room": "100",
        "sender": "Anubis",
        "message": " You shalln’t have anything! You will be weighed in the scales where every good deed of yours will counter every bad deed. Knowing who you are, you will be punished for all eternity!"
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": "(in the field of reeds) Oh wow where am I. (sees Ali) Ali? Is that you? "
    },
    {
        "roomNo": "100",
        "sender": "Ali",
        "message": "Hello Jones. I’ve been waiting for you. Glad to see you understood the reality of the situation. Come now, eternal peace awaits us."
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": "(in the field of reeds) Oh wow dying wasn’t part of my agenda today -(sees Ali) Ali? Is that you?"
    },
    {
        "roomNo": "100",
        "sender": "Ali",
        "message": "Miss me? Can’t stay away from me for even a few hours? Actually it’s such a relief that you showed up instead of the creepy dead mummy"
    },
    {
        "roomNo": "100",
        "sender": "MJ",
        "message": "But, we are dead.?"
    },
    {
        "roomNo": "100",
        "sender": "Ali",
        "message": "Oh yeah, that sucks but you’ll get used to it."
    },
    {
        "roomNo": "100",
        "sender": "Ali",
        "message": "Come now, eternal peace awaits us. Oh, and they have chocolate here."
    }
]